{
  "model_name": "test_model",
  "model_description": "this model is just to test the db",
  "is_running": false,
  "protocol": "NN",
  "model": {
    "model": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Dense",
            "config": {
              "name": "first",
              "trainable": true,
              "batch_input_shape": [
                null,
                61
              ],
              "dtype": "float32",
              "units": 72,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "last",
              "trainable": true,
              "dtype": "float32",
              "units": 2,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      },
      "keras_version": "2.2.4-tf",
      "backend": "tensorflow"
    },
    "compile": {
      "loss": "sparse_categorical_crossentropy",
      "metrics": [
        "accuracy"
      ],
      "optimizer": {
        "class_name": "Adam",
        "config": {
          "learning_rate": 0.001,
          "decay": 0.0,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-07,
          "amsgrad": false
        }
      }
    }
  },
  "git_version": "e9339081b76ad3a89b1862bd38d8af26f0541f1c",
  "timestamp": "2019-12-17 09:37:28.290756",
  "testing": true,
  "_id": "5df8a1d8414f106ec7349c7d",
  "parameters": [
    [
      [
        [
          0.07263809442520142,
          -0.17854151129722595,
          -0.168686643242836,
          -0.20697171986103058,
          0.10077863931655884,
          -0.1361425220966339,
          0.1348986029624939,
          0.02071496844291687,
          0.1309206187725067,
          -0.025882691144943237,
          0.09362038969993591,
          -0.11503752321004868,
          0.20279467105865479,
          -0.020802021026611328,
          -0.04866237938404083,
          0.1689545214176178,
          0.07960528135299683,
          0.06884649395942688,
          -0.20929227769374847,
          0.1648593544960022,
          -0.057814985513687134,
          0.09492567181587219,
          -0.03133818507194519,
          0.2042662501335144,
          0.06519114971160889,
          -0.04376782476902008,
          0.03385664522647858,
          -0.06002144515514374,
          -0.1969970464706421,
          -0.08637122809886932,
          0.20847764611244202,
          0.11941364407539368,
          -0.20876005291938782,
          0.2051674723625183,
          0.038955241441726685,
          -0.11747470498085022,
          0.08297166228294373,
          0.13721370697021484,
          -0.18170779943466187,
          0.11681938171386719,
          0.17393431067466736,
          0.05377045273780823,
          -0.09141148626804352,
          -0.11243065446615219,
          0.1748613715171814,
          -0.033301085233688354,
          0.03283640742301941,
          -0.12076668441295624,
          0.01747976243495941,
          -0.035670503973960876,
          -0.03562381863594055,
          -0.18310554325580597,
          0.15556669235229492,
          -0.19675427675247192,
          -0.019866004586219788,
          -0.15452954173088074,
          -0.0203639417886734,
          0.1515703797340393,
          -0.182554230093956,
          -0.07385009527206421,
          0.05159148573875427,
          0.018406003713607788,
          0.16199558973312378,
          -0.12906336784362793,
          -0.02413065731525421,
          -0.20845575630664825,
          -0.093873530626297,
          0.2035306990146637,
          -0.13017156720161438,
          -0.08496062457561493,
          -0.05897711217403412,
          0.10119235515594482
        ],
        [
          0.08030492067337036,
          0.15874052047729492,
          0.08376383781433105,
          0.008043885231018066,
          0.05759748816490173,
          0.00040490925312042236,
          -0.1800180971622467,
          0.05408021807670593,
          0.17043057084083557,
          0.020182594656944275,
          -0.1794273853302002,
          0.06810954213142395,
          0.13878419995307922,
          0.14767736196517944,
          -0.1982521414756775,
          -0.14807000756263733,
          -0.08094793558120728,
          0.20417609810829163,
          0.1134321391582489,
          -0.03945647180080414,
          -0.024104684591293335,
          0.10757669806480408,
          -0.16588056087493896,
          -0.15379071235656738,
          0.007070139050483704,
          0.060260653495788574,
          -0.2034490704536438,
          0.17083370685577393,
          0.14527416229248047,
          -0.08496087789535522,
          0.01718878746032715,
          -0.13935458660125732,
          0.14434579014778137,
          0.20370298624038696,
          0.20303013920783997,
          -0.023370862007141113,
          -0.019352510571479797,
          0.12047666311264038,
          -0.13158780336380005,
          -0.16112954914569855,
          0.0718671977519989,
          0.18715423345565796,
          -0.027991265058517456,
          0.01648828387260437,
          0.08190858364105225,
          -0.03734661638736725,
          -0.10192350298166275,
          -0.017679542303085327,
          0.08850908279418945,
          -0.19254769384860992,
          0.14203503727912903,
          0.12527233362197876,
          -0.019108891487121582,
          -0.1960216760635376,
          -0.14134377241134644,
          -0.03095105290412903,
          -0.21236954629421234,
          0.07740449905395508,
          -0.04983945190906525,
          0.06389978528022766,
          0.0025346577167510986,
          0.037159159779548645,
          -0.18254081904888153,
          -0.06593361496925354,
          -0.19586347043514252,
          -0.0453730970621109,
          0.004689380526542664,
          0.04502257704734802,
          0.05799773335456848,
          -0.042700186371803284,
          -0.13148272037506104,
          0.14091181755065918
        ],
        [
          -0.11457979679107666,
          -0.049342215061187744,
          0.20433616638183594,
          -0.05360764265060425,
          0.12872442603111267,
          -0.04778778553009033,
          -0.011335060000419617,
          -0.014219745993614197,
          0.20423129200935364,
          0.030340075492858887,
          -0.018682807683944702,
          0.03183460235595703,
          -0.18974995613098145,
          0.17708536982536316,
          -0.18180836737155914,
          0.15383082628250122,
          -0.161888986825943,
          -0.05589205026626587,
          -0.1074071079492569,
          0.12094765901565552,
          -0.09512913972139359,
          -0.008318513631820679,
          -0.20331811904907227,
          -0.20451605319976807,
          -0.11700401455163956,
          -0.0020065903663635254,
          0.12180617451667786,
          -0.007824718952178955,
          0.16554123163223267,
          0.13775953650474548,
          0.1581401526927948,
          -0.13298286497592926,
          -0.1458388864994049,
          0.13011524081230164,
          -0.18611687421798706,
          -0.14138245582580566,
          -0.04941509664058685,
          0.16001412272453308,
          -0.09126503765583038,
          0.1311839520931244,
          0.14137259125709534,
          -0.025776997208595276,
          -0.2037738859653473,
          -0.05549527704715729,
          0.20803308486938477,
          0.04643866419792175,
          0.12798675894737244,
          0.0556492805480957,
          0.18287134170532227,
          0.04178842902183533,
          -0.20682527124881744,
          -0.15244632959365845,
          -0.1441241204738617,
          0.15721464157104492,
          -0.0934119001030922,
          0.014108076691627502,
          -0.1309071034193039,
          -0.19205963611602783,
          -0.07426731288433075,
          0.11051717400550842,
          0.12148243188858032,
          -0.058155372738838196,
          0.18699562549591064,
          -0.00039958953857421875,
          -0.1939069628715515,
          0.01861777901649475,
          -0.17110255360603333,
          0.149004727602005,
          0.05398455262184143,
          -0.19052045047283173,
          -0.1436985433101654,
          -0.09066186845302582
        ],
        [
          0.08898624777793884,
          0.13124039769172668,
          -0.09866505116224289,
          -0.06913387775421143,
          -0.15546004474163055,
          -0.20854412019252777,
          -0.00451168417930603,
          0.07726305723190308,
          0.1992793083190918,
          -0.1367744505405426,
          0.20038321614265442,
          -0.1765051782131195,
          -0.15065009891986847,
          -0.09664645791053772,
          0.07991388440132141,
          0.07414746284484863,
          -0.08426138758659363,
          -0.12342318147420883,
          -0.08519153296947479,
          0.2031736969947815,
          -0.04218609631061554,
          -0.12181106954813004,
          0.08903679251670837,
          0.2002888023853302,
          -0.14815984666347504,
          -0.10884567350149155,
          0.12376901507377625,
          -0.09158346056938171,
          0.20551323890686035,
          0.16685160994529724,
          -0.2053224891424179,
          0.19672927260398865,
          -0.01750609278678894,
          -0.1782296597957611,
          0.029164686799049377,
          -0.010890394449234009,
          -0.17930221557617188,
          0.08739849925041199,
          -0.10201338678598404,
          -0.12183710187673569,
          0.11574846506118774,
          -0.19286136329174042,
          -0.11871552467346191,
          -0.04225754737854004,
          -0.2103586494922638,
          -0.14104494452476501,
          -0.1098116785287857,
          -0.12124532461166382,
          -0.11833709478378296,
          -0.15919283032417297,
          -0.004599586129188538,
          0.026489093899726868,
          0.19611692428588867,
          0.11996865272521973,
          0.1554282009601593,
          0.02235068380832672,
          -0.1391792744398117,
          0.06508180499076843,
          -0.07040169835090637,
          0.1978776752948761,
          0.027180984616279602,
          0.041292667388916016,
          -0.14715445041656494,
          -0.18714308738708496,
          0.10871830582618713,
          0.0968620777130127,
          0.09130910038948059,
          -0.02920570969581604,
          0.03261709213256836,
          -0.05170197784900665,
          -0.047366827726364136,
          0.022389516234397888
        ],
        [
          -0.10282214730978012,
          0.0022709816694259644,
          0.010762929916381836,
          -0.20958365499973297,
          -0.03742896020412445,
          -0.10806116461753845,
          -0.011713430285453796,
          0.17153790593147278,
          0.09451103210449219,
          0.11225280165672302,
          -0.1711636185646057,
          -0.12506186962127686,
          0.005751281976699829,
          -0.17339283227920532,
          -0.08785901963710785,
          0.16224640607833862,
          -0.11234932392835617,
          0.020775437355041504,
          0.14605394005775452,
          0.20566633343696594,
          -0.18132618069648743,
          -0.0127839595079422,
          0.14081352949142456,
          0.107778400182724,
          0.15079745650291443,
          -0.12533286213874817,
          -0.0363665372133255,
          0.1738106608390808,
          0.03426302969455719,
          0.10126796364784241,
          0.03365175426006317,
          0.14706116914749146,
          0.1277669072151184,
          0.1927143633365631,
          -0.04449084401130676,
          -0.01849949359893799,
          -0.18712009489536285,
          0.01938563585281372,
          0.1584642231464386,
          -0.17056213319301605,
          -0.11269965022802353,
          0.2071789801120758,
          -0.020128458738327026,
          0.11146247386932373,
          -0.19138111174106598,
          -0.03332953155040741,
          0.03254745900630951,
          -0.16685540974140167,
          0.20235231518745422,
          0.012985751032829285,
          0.12930116057395935,
          0.01751430332660675,
          0.025579914450645447,
          -0.15886063873767853,
          -0.18435066938400269,
          -0.1926102340221405,
          -0.18220284581184387,
          0.08374020457267761,
          0.020347431302070618,
          0.04659503698348999,
          0.15384215116500854,
          -0.1883753538131714,
          0.04546114802360535,
          0.17928561568260193,
          -0.02782587707042694,
          0.17149844765663147,
          -0.041425034403800964,
          0.10341012477874756,
          0.20240619778633118,
          0.0699305534362793,
          0.17494145035743713,
          0.019964948296546936
        ],
        [
          -0.20457181334495544,
          -0.05464327335357666,
          -0.19790120422840118,
          0.16104286909103394,
          -0.024845227599143982,
          0.0010688453912734985,
          -0.08788084983825684,
          -0.18795448541641235,
          0.05228316783905029,
          -0.11621803790330887,
          0.0004191398620605469,
          0.06331250071525574,
          -0.10141736268997192,
          -0.06060299277305603,
          0.006943702697753906,
          0.1473751962184906,
          -0.15093114972114563,
          0.023513823747634888,
          0.2079000473022461,
          0.05929657816886902,
          0.11944428086280823,
          -0.1129823699593544,
          -0.004822909832000732,
          -0.14045564830303192,
          -0.060203298926353455,
          0.1357346773147583,
          -0.14969053864479065,
          -0.06925931572914124,
          -0.16301308572292328,
          0.19431334733963013,
          0.10065284371376038,
          0.20842385292053223,
          -0.1652451753616333,
          0.15953591465950012,
          -0.15671980381011963,
          -0.1033366471529007,
          0.040003061294555664,
          -0.1495111584663391,
          0.09306719899177551,
          0.1410253345966339,
          0.18966877460479736,
          -0.04483012855052948,
          -0.16285356879234314,
          -0.10065224766731262,
          -0.1911199688911438,
          0.04790213704109192,
          -0.07248611748218536,
          -0.1727227121591568,
          0.1799820363521576,
          -0.20074836909770966,
          0.09501129388809204,
          -0.20400407910346985,
          0.18186244368553162,
          -0.061294421553611755,
          -0.003946244716644287,
          -0.18774697184562683,
          -0.19763849675655365,
          0.20793801546096802,
          0.020076453685760498,
          -0.12131211906671524,
          0.04284942150115967,
          0.19470617175102234,
          0.11874732375144958,
          -0.194950133562088,
          -0.21122179925441742,
          -0.08842658996582031,
          -0.19771039485931396,
          0.12053313851356506,
          -0.14029425382614136,
          -0.10611356794834137,
          0.14538803696632385,
          -0.19949792325496674
        ],
        [
          0.19335773587226868,
          0.0962279736995697,
          0.19634035229682922,
          -0.0021963417530059814,
          0.12536099553108215,
          -0.2058834731578827,
          -0.1475360095500946,
          0.16426053643226624,
          -0.07680481672286987,
          -0.14821407198905945,
          -0.17768114805221558,
          -0.16170881688594818,
          0.02770206332206726,
          0.03379906713962555,
          -0.1082092896103859,
          0.06355300545692444,
          -0.19940221309661865,
          -0.1974441409111023,
          -0.0005785524845123291,
          -0.16348646581172943,
          0.04839581251144409,
          0.04383629560470581,
          0.17471638321876526,
          -0.14777326583862305,
          -0.06097798049449921,
          -0.0021843314170837402,
          0.18297138810157776,
          0.05795606970787048,
          0.07754069566726685,
          -0.03684842586517334,
          -0.008876308798789978,
          0.1928335428237915,
          -0.07927156984806061,
          0.10122418403625488,
          -0.19863229990005493,
          0.06943017244338989,
          0.21139448881149292,
          -0.15755045413970947,
          -0.20838774740695953,
          -0.17608016729354858,
          -0.06151860952377319,
          0.020270049571990967,
          0.07771798968315125,
          -0.13547945022583008,
          -0.13244441151618958,
          -0.18827953934669495,
          -0.16773441433906555,
          0.18821650743484497,
          0.10771423578262329,
          0.16722610592842102,
          -0.16579188406467438,
          -0.16396556794643402,
          0.1841105818748474,
          0.12494686245918274,
          0.15792012214660645,
          -0.12185093015432358,
          -0.0951608419418335,
          -0.06896580755710602,
          -0.09762967377901077,
          -0.13325732946395874,
          0.17851850390434265,
          -0.011858567595481873,
          0.17420852184295654,
          0.046823859214782715,
          0.029016971588134766,
          0.05337515473365784,
          -0.11348709464073181,
          -0.0656348466873169,
          0.16876018047332764,
          -0.02473422884941101,
          0.14493608474731445,
          0.0700066089630127
        ],
        [
          0.03650413453578949,
          -0.13565881550312042,
          -0.028179138898849487,
          0.07177731394767761,
          -0.04270099103450775,
          -0.06647327542304993,
          -0.15232819318771362,
          0.21158123016357422,
          -0.041464775800704956,
          0.12693271040916443,
          -0.03304074704647064,
          -0.1209784597158432,
          0.18991631269454956,
          0.1359976828098297,
          0.14102381467819214,
          0.053172916173934937,
          0.025399833917617798,
          -0.002921193838119507,
          0.1404980719089508,
          -0.07012723386287689,
          -0.06633134186267853,
          -0.12089546024799347,
          -0.1905212551355362,
          -0.07939852774143219,
          -0.16171002388000488,
          0.03103804588317871,
          -0.003015175461769104,
          -0.06909868121147156,
          0.12760424613952637,
          0.02594102919101715,
          0.007781371474266052,
          -0.12866973876953125,
          -0.1573001891374588,
          0.18981674313545227,
          0.14876413345336914,
          -0.07976266741752625,
          0.09594032168388367,
          0.15275421738624573,
          0.17818111181259155,
          -0.12952756881713867,
          -0.19365888833999634,
          -0.16787579655647278,
          -0.09012068808078766,
          -0.08364126086235046,
          0.013082876801490784,
          0.0951705276966095,
          0.04709029197692871,
          -0.1180543303489685,
          0.09325811266899109,
          -0.14500120282173157,
          0.10083165764808655,
          0.039288341999053955,
          0.1862652599811554,
          0.1293366551399231,
          4.92781400680542e-05,
          0.1439289152622223,
          -0.14171196520328522,
          -0.12546390295028687,
          -0.07815268635749817,
          -0.1609758585691452,
          -0.14763040840625763,
          0.19008564949035645,
          0.1519937813282013,
          -0.17486684024333954,
          -0.1568305492401123,
          -0.1502322256565094,
          0.05647319555282593,
          -0.10547403991222382,
          0.15860071778297424,
          0.18896260857582092,
          -0.14376813173294067,
          0.08877858519554138
        ],
        [
          -0.02663300931453705,
          0.023977279663085938,
          -0.013827487826347351,
          0.04880842566490173,
          -0.07660549879074097,
          -0.017903819680213928,
          0.18399330973625183,
          -0.08891095966100693,
          -0.03100740909576416,
          0.07198736071586609,
          -0.024474501609802246,
          0.07062911987304688,
          0.07999205589294434,
          -0.20665587484836578,
          0.03950813412666321,
          -0.1070588082075119,
          0.1523645520210266,
          0.2099369764328003,
          0.06916329264640808,
          -0.009958222508430481,
          0.02899615466594696,
          -0.12890025973320007,
          -0.20909938216209412,
          0.206760436296463,
          -0.10666361451148987,
          -0.20363816618919373,
          0.14776477217674255,
          0.17250213027000427,
          0.013876497745513916,
          0.18322905898094177,
          0.19025418162345886,
          0.18915656208992004,
          0.06923902034759521,
          -0.07956993579864502,
          0.10545024275779724,
          0.05095645785331726,
          -0.054738521575927734,
          0.014308705925941467,
          -0.07818742096424103,
          -0.06686092913150787,
          -0.034851908683776855,
          -0.1469065248966217,
          0.13243737816810608,
          -0.1873004287481308,
          -0.06495130062103271,
          -0.11802181601524353,
          0.18764102458953857,
          0.0908215343952179,
          0.00411851704120636,
          -0.20551350712776184,
          -0.2077684849500656,
          0.14286431670188904,
          0.09913524985313416,
          0.1944276988506317,
          0.16897240281105042,
          -0.07238362729549408,
          0.03879237174987793,
          0.057267069816589355,
          0.1824001967906952,
          -0.20872455835342407,
          -0.004772678017616272,
          0.16781377792358398,
          0.18691378831863403,
          -0.17956918478012085,
          0.008547797799110413,
          -0.07707051932811737,
          -0.07363173365592957,
          0.16298574209213257,
          0.006017342209815979,
          0.024868324398994446,
          -0.20964229106903076,
          -0.03200748562812805
        ],
        [
          -0.04122500121593475,
          -0.08238296210765839,
          0.10740047693252563,
          -0.20504093170166016,
          0.010312139987945557,
          -0.16559965908527374,
          -0.18441614508628845,
          0.18807551264762878,
          -0.09292683005332947,
          0.15695598721504211,
          -0.1663786917924881,
          -0.07725919783115387,
          -0.0023870468139648438,
          0.09462729096412659,
          0.02706451714038849,
          0.1283024549484253,
          0.0013308525085449219,
          -0.07874587178230286,
          -0.023898229002952576,
          0.03761795163154602,
          -0.07499095797538757,
          -0.16620641946792603,
          0.19147688150405884,
          -0.20386284589767456,
          0.2075808048248291,
          0.0011333078145980835,
          -0.15540586411952972,
          0.1760222315788269,
          0.05349978804588318,
          -0.04174867272377014,
          -0.11199479550123215,
          0.06745517253875732,
          0.15349215269088745,
          -0.08921550214290619,
          -0.00460486114025116,
          0.07095912098884583,
          0.11397728323936462,
          0.15029573440551758,
          -0.19869235157966614,
          0.20074760913848877,
          -0.21163764595985413,
          0.06662434339523315,
          -0.13075846433639526,
          0.17195218801498413,
          -0.004635542631149292,
          0.09282809495925903,
          -0.1342851221561432,
          -0.13336063921451569,
          -0.20713528990745544,
          0.09126991033554077,
          0.16790756583213806,
          -0.04904460906982422,
          0.06262457370758057,
          -0.17945681512355804,
          -0.18742449581623077,
          -0.01276668906211853,
          0.11075437068939209,
          -0.14098680019378662,
          0.04526284337043762,
          -0.007579326629638672,
          0.1683903932571411,
          -0.08035935461521149,
          0.07689028978347778,
          -0.09796708077192307,
          -0.15036018192768097,
          -0.04827311635017395,
          -0.1413545459508896,
          0.004774138331413269,
          0.11609300971031189,
          -0.19013826549053192,
          -0.10391824692487717,
          0.08424502611160278
        ],
        [
          0.16647890210151672,
          0.20735278725624084,
          -0.092111736536026,
          0.1376989781856537,
          -0.20778964459896088,
          -0.03009888529777527,
          0.16456767916679382,
          -0.20170986652374268,
          -0.07737810909748077,
          -0.15327014029026031,
          -0.016366198658943176,
          -0.012557297945022583,
          -0.055993422865867615,
          0.11642834544181824,
          0.0893406867980957,
          0.16579440236091614,
          -0.16674622893333435,
          -0.0021384507417678833,
          -0.19963303208351135,
          0.034635841846466064,
          -0.1536352038383484,
          0.18077567219734192,
          -0.17150741815567017,
          0.07063153386116028,
          0.026469796895980835,
          0.21136990189552307,
          -0.16953009366989136,
          0.08279556035995483,
          -0.20132459700107574,
          0.12025880813598633,
          -0.12902164459228516,
          0.09776625037193298,
          0.009852230548858643,
          -0.09713143110275269,
          -0.04747852683067322,
          -0.11670199781656265,
          -0.06368537247180939,
          0.1336938440799713,
          -0.1717807650566101,
          -0.021304666996002197,
          -0.17174729704856873,
          -0.05327706038951874,
          0.014004677534103394,
          -0.10390999168157578,
          -0.031057342886924744,
          -0.1897227168083191,
          -0.016463786363601685,
          -0.160049706697464,
          0.04492378234863281,
          -0.15489313006401062,
          0.16493794322013855,
          0.14167407155036926,
          -0.1774744838476181,
          -0.1901327520608902,
          0.01420813798904419,
          -0.10832236707210541,
          -0.11230461299419403,
          -0.12464329600334167,
          0.027299433946609497,
          0.07701444625854492,
          0.03238688409328461,
          0.1976911425590515,
          0.087747722864151,
          0.2013431191444397,
          0.04375040531158447,
          0.035154640674591064,
          -0.18939244747161865,
          -0.08456355333328247,
          -0.037877216935157776,
          0.15667924284934998,
          -0.060059621930122375,
          -0.11457832902669907
        ],
        [
          0.18024492263793945,
          -0.050117820501327515,
          0.14196819067001343,
          -0.12106499820947647,
          0.1709752380847931,
          -0.038578689098358154,
          0.0801701545715332,
          0.14664486050605774,
          0.1349581778049469,
          0.1723344624042511,
          0.09694650769233704,
          -0.1715543121099472,
          -0.04623396694660187,
          -0.177869975566864,
          -0.10148749500513077,
          0.05959770083427429,
          0.05186963081359863,
          0.09442779421806335,
          0.09457331895828247,
          0.027183815836906433,
          -0.11663246899843216,
          0.10596945881843567,
          0.07166257500648499,
          0.08904245495796204,
          -0.17902880907058716,
          0.1309603750705719,
          0.0029016435146331787,
          0.20769914984703064,
          0.1538010537624359,
          -0.10753481835126877,
          -0.10209456086158752,
          -0.13993299007415771,
          -0.06944040954113007,
          -0.1488034725189209,
          0.12483075261116028,
          -0.10954318195581436,
          -0.1762615144252777,
          -0.022283479571342468,
          0.07174864411354065,
          -0.1699579507112503,
          -0.10294575989246368,
          -0.011229828000068665,
          0.15582364797592163,
          -0.19327032566070557,
          0.2003835141658783,
          -0.107416070997715,
          -0.026778295636177063,
          0.13349199295043945,
          0.15851223468780518,
          0.09587770700454712,
          -0.05862613022327423,
          -0.06361639499664307,
          0.19590464234352112,
          -0.05749337375164032,
          0.06682547926902771,
          0.06548035144805908,
          0.1602167785167694,
          -0.11972659826278687,
          -0.10935217142105103,
          0.14592978358268738,
          0.210677832365036,
          0.15872347354888916,
          0.1646524965763092,
          -0.08841995894908905,
          0.04500150680541992,
          -0.17215853929519653,
          0.0670824646949768,
          0.02454225718975067,
          -0.12068504840135574,
          0.06572851538658142,
          -0.16898424923419952,
          0.1405211091041565
        ],
        [
          -0.0558391809463501,
          0.18666231632232666,
          0.11730024218559265,
          -0.0295916348695755,
          0.07243704795837402,
          -0.1497150957584381,
          -0.004524335265159607,
          0.20533636212348938,
          -0.12999624013900757,
          0.02966885268688202,
          -0.07184295356273651,
          -0.035742416977882385,
          -0.18636760115623474,
          0.1742573380470276,
          0.06922438740730286,
          0.005410730838775635,
          -0.06848655641078949,
          0.11666694283485413,
          0.1754627227783203,
          0.11414778232574463,
          0.14255332946777344,
          -0.06270229816436768,
          -0.12573224306106567,
          0.04677838087081909,
          -0.12496232241392136,
          -0.11887838691473007,
          0.028006404638290405,
          -0.20669010281562805,
          -0.02991420030593872,
          -0.08753123134374619,
          -0.01883704960346222,
          0.028067737817764282,
          -0.006286248564720154,
          -0.1048467680811882,
          -0.06549446284770966,
          0.17120873928070068,
          0.16371768712997437,
          -0.15166699886322021,
          -0.12072587013244629,
          0.16619467735290527,
          0.04296720027923584,
          -0.13168583810329437,
          -0.045419931411743164,
          0.09953740239143372,
          0.02847026288509369,
          -0.10490723699331284,
          -0.03858040273189545,
          0.1940721869468689,
          0.008018016815185547,
          -0.14185765385627747,
          -0.16190701723098755,
          -0.0954480692744255,
          -0.027195870876312256,
          0.12635207176208496,
          0.12572982907295227,
          -0.12048067152500153,
          0.11760425567626953,
          0.08257302641868591,
          -0.0031317472457885742,
          0.11159363389015198,
          0.02599474787712097,
          0.09855678677558899,
          -0.01284027099609375,
          -0.21211446821689606,
          0.04054632782936096,
          0.18735110759735107,
          0.14743134379386902,
          -0.18105313181877136,
          -0.1370828002691269,
          0.15744972229003906,
          -0.009971186518669128,
          0.2060438096523285
        ],
        [
          -0.03078611195087433,
          -0.0811898410320282,
          0.17703604698181152,
          -0.042926132678985596,
          0.06898033618927002,
          -0.12056128680706024,
          0.023269429802894592,
          0.0353412926197052,
          0.1938020884990692,
          -0.16307349503040314,
          0.0313946008682251,
          -0.14971598982810974,
          -0.05574275553226471,
          -0.04821832478046417,
          -0.11232051253318787,
          0.11192414164543152,
          0.12599825859069824,
          0.014333277940750122,
          0.05208474397659302,
          0.20250144600868225,
          0.1540742814540863,
          -0.1668051779270172,
          0.07021042704582214,
          -0.01713961362838745,
          0.0943528413772583,
          0.19448158144950867,
          0.0832812488079071,
          0.1498929262161255,
          0.03778091073036194,
          -0.20877979695796967,
          -0.06532695889472961,
          -0.0978437289595604,
          -0.009206369519233704,
          0.19583699107170105,
          0.16413575410842896,
          -0.1624699831008911,
          0.013539493083953857,
          0.1320008635520935,
          -0.09527422487735748,
          0.13582217693328857,
          -0.13009408116340637,
          0.11818072199821472,
          -0.07169102132320404,
          0.17933624982833862,
          0.02462521195411682,
          -0.13061891496181488,
          0.03492589294910431,
          -0.10023735463619232,
          -0.028539344668388367,
          -0.025216013193130493,
          0.05698424577713013,
          0.011455625295639038,
          -0.02468182146549225,
          0.15881118178367615,
          -0.19042924046516418,
          0.09691095352172852,
          0.20033195614814758,
          0.1371689736843109,
          -0.14196819067001343,
          -0.1465616524219513,
          0.20736023783683777,
          0.11639866232872009,
          0.062414318323135376,
          0.1543554961681366,
          0.08122360706329346,
          -0.09073960036039352,
          -0.06563332676887512,
          0.16841796040534973,
          -0.14650185406208038,
          0.03676821291446686,
          0.05577594041824341,
          -0.041903167963027954
        ],
        [
          0.06354424357414246,
          0.028264880180358887,
          0.04576241970062256,
          0.03854134678840637,
          0.13611993193626404,
          0.1946592628955841,
          -0.026461496949195862,
          -0.15345695614814758,
          -0.05881541967391968,
          0.02414579689502716,
          -0.03096507489681244,
          -0.05608507990837097,
          -0.05969791114330292,
          0.1907801330089569,
          -0.006794914603233337,
          0.1707460880279541,
          0.13890299201011658,
          0.20068371295928955,
          0.06250697374343872,
          0.06661629676818848,
          -0.061695948243141174,
          0.04294005036354065,
          0.022584185004234314,
          0.11374372243881226,
          -0.17772266268730164,
          -0.03671424090862274,
          0.08237546682357788,
          -0.13422809541225433,
          -0.1756504476070404,
          -0.10575787723064423,
          -0.13246417045593262,
          0.11955764889717102,
          0.06570497155189514,
          -0.16788151860237122,
          0.03771957755088806,
          0.04785439372062683,
          0.1878146231174469,
          0.0634656548500061,
          0.009402647614479065,
          0.19213822484016418,
          0.07578063011169434,
          0.15970060229301453,
          -0.06995652616024017,
          -0.008100703358650208,
          -0.032752543687820435,
          0.09952932596206665,
          0.1169080138206482,
          0.1411823332309723,
          -0.19255483150482178,
          -0.10928578674793243,
          -0.15872012078762054,
          -0.17548930644989014,
          -0.17679691314697266,
          0.029711902141571045,
          0.1940123438835144,
          0.05781063437461853,
          0.027755841612815857,
          0.11815202236175537,
          0.1071317195892334,
          0.14419934153556824,
          0.11405447125434875,
          -0.0640719085931778,
          -0.09208626300096512,
          -0.11225523799657822,
          0.19365042448043823,
          0.12124359607696533,
          0.07629111409187317,
          0.13258713483810425,
          0.1225089430809021,
          -0.121426060795784,
          -0.1644507497549057,
          0.02798919379711151
        ],
        [
          0.09261184930801392,
          -0.15670061111450195,
          0.10622385144233704,
          0.10228151082992554,
          0.17583110928535461,
          0.17789378762245178,
          -0.19773638248443604,
          0.0238703191280365,
          0.21108931303024292,
          0.1733475625514984,
          -0.20806030929088593,
          0.002785727381706238,
          -0.11850415915250778,
          -0.1231483593583107,
          -0.01739068329334259,
          -0.19636966288089752,
          0.1258450746536255,
          0.14453062415122986,
          0.2070232629776001,
          0.18085238337516785,
          -0.06201194226741791,
          0.1435241401195526,
          0.13555359840393066,
          -0.09943962842226028,
          -0.1534246951341629,
          0.19397321343421936,
          -0.07087016105651855,
          -0.15368503332138062,
          0.19506773352622986,
          0.0005349069833755493,
          -0.11584533005952835,
          -0.019067659974098206,
          -0.05150386691093445,
          -0.04900096356868744,
          -0.022207722067832947,
          0.027324095368385315,
          -0.09879878908395767,
          -0.19187799096107483,
          0.063304603099823,
          -0.0877101942896843,
          0.2096494734287262,
          -0.10478033125400543,
          -0.15861839056015015,
          -0.049440816044807434,
          -0.07260710000991821,
          0.05665755271911621,
          0.00284634530544281,
          -0.09765291213989258,
          -0.05210086703300476,
          0.04636496305465698,
          -0.12662005424499512,
          0.08790671825408936,
          0.13775649666786194,
          -0.15080951154232025,
          0.16641312837600708,
          -0.05356748402118683,
          -0.06108902394771576,
          -0.06670333445072174,
          0.21074658632278442,
          -0.21195626258850098,
          -0.02797207236289978,
          -0.206731379032135,
          -0.16593913733959198,
          -0.10671456158161163,
          0.11059638857841492,
          -0.1850091814994812,
          0.2034374177455902,
          -0.02496403455734253,
          -0.010960623621940613,
          0.010136768221855164,
          -0.1677653044462204,
          -0.05261297523975372
        ],
        [
          0.08882564306259155,
          -0.12159423530101776,
          -0.20421838760375977,
          -0.06917692720890045,
          -0.18343044817447662,
          0.18092799186706543,
          -0.0020358115434646606,
          -0.018493518233299255,
          0.13876676559448242,
          0.2088448703289032,
          0.20935603976249695,
          -0.05522826313972473,
          0.14052435755729675,
          -0.10939496010541916,
          -0.18246130645275116,
          0.20841863751411438,
          0.11488929390907288,
          0.1250612735748291,
          0.04026499390602112,
          -0.020078986883163452,
          0.20041322708129883,
          0.07613909244537354,
          0.10602840781211853,
          -0.16739320755004883,
          0.15996119379997253,
          -0.20554834604263306,
          -0.09210824221372604,
          0.052593737840652466,
          0.18145757913589478,
          -0.08610081672668457,
          -0.1320343315601349,
          -0.18808898329734802,
          -0.1840905398130417,
          -0.12022864073514938,
          -0.1320369690656662,
          -0.011869311332702637,
          -0.015219971537590027,
          0.062208354473114014,
          0.11929109692573547,
          0.004749789834022522,
          0.1851080358028412,
          -0.20142748951911926,
          0.15109679102897644,
          -0.009344622492790222,
          -0.17198757827281952,
          -0.18164262175559998,
          0.10399684309959412,
          -0.09367366135120392,
          0.0625634491443634,
          -0.06847992539405823,
          -0.07098375260829926,
          0.04712614417076111,
          -0.1586584895849228,
          -0.004512891173362732,
          0.18407049775123596,
          0.2002822756767273,
          -0.006146728992462158,
          0.06005275249481201,
          0.04622778296470642,
          -0.03895898163318634,
          0.1346954107284546,
          -0.007972434163093567,
          -0.1725999116897583,
          -0.210627481341362,
          -0.14211520552635193,
          -0.08771900087594986,
          -0.16865438222885132,
          -0.19420801103115082,
          0.17670178413391113,
          0.14811614155769348,
          0.023162782192230225,
          -0.21206550300121307
        ],
        [
          0.06551122665405273,
          -0.1801460236310959,
          -0.15603794157505035,
          0.06283995509147644,
          -0.08931870758533478,
          0.19545218348503113,
          0.08954629302024841,
          0.13588309288024902,
          0.07211899757385254,
          0.03202010691165924,
          -0.03149867057800293,
          0.14475905895233154,
          0.14535701274871826,
          -0.15111283957958221,
          0.08694109320640564,
          -0.03851209580898285,
          0.017728552222251892,
          -0.0639590322971344,
          0.11159732937812805,
          -0.01982817053794861,
          -0.16725490987300873,
          0.01024407148361206,
          -0.08242727816104889,
          -0.16309380531311035,
          -0.15411162376403809,
          -0.1867353916168213,
          0.07107880711555481,
          -0.12386617809534073,
          -0.03227455914020538,
          -0.09008042514324188,
          -0.14421933889389038,
          -0.17015862464904785,
          0.034720808267593384,
          -0.16905149817466736,
          -0.15716294944286346,
          -0.1977747082710266,
          0.15921366214752197,
          0.046504586935043335,
          0.07892021536827087,
          0.08190992474555969,
          0.12758606672286987,
          0.21176078915596008,
          0.12580841779708862,
          -0.02394147217273712,
          -0.10417108982801437,
          -0.09584802389144897,
          0.19073757529258728,
          -0.1744633913040161,
          0.12952139973640442,
          -0.20631228387355804,
          -0.19459378719329834,
          -0.1540207713842392,
          -0.14145749807357788,
          0.20955422520637512,
          0.18886932730674744,
          -0.06212961673736572,
          0.18432554602622986,
          0.06583723425865173,
          0.19219067692756653,
          -0.17739340662956238,
          -0.14225852489471436,
          0.0679028332233429,
          -0.17433036863803864,
          0.15256646275520325,
          -0.04371084272861481,
          0.04124388098716736,
          0.1307636797428131,
          -0.05163624882698059,
          0.14450427889823914,
          -0.08169451355934143,
          0.17930105328559875,
          0.16428935527801514
        ],
        [
          -0.18849273025989532,
          -0.08488354086875916,
          0.0720241367816925,
          0.1589420735836029,
          -0.13895970582962036,
          -0.04625508189201355,
          -0.028265535831451416,
          0.19292885065078735,
          0.07586145401000977,
          0.03344641625881195,
          0.05593535304069519,
          0.18488472700119019,
          0.15604427456855774,
          0.0937904417514801,
          0.030725806951522827,
          0.18338456749916077,
          0.19164574146270752,
          -0.19236716628074646,
          0.16075685620307922,
          -0.019399359822273254,
          0.08676084876060486,
          -0.17375192046165466,
          0.021327614784240723,
          0.047489434480667114,
          -0.1332925260066986,
          -0.1353953778743744,
          -0.08388999104499817,
          0.17235365509986877,
          -0.18330445885658264,
          0.009012982249259949,
          0.20175635814666748,
          0.06338846683502197,
          0.03632234036922455,
          -0.07942834496498108,
          0.118004709482193,
          0.11547374725341797,
          0.19097644090652466,
          -0.03633473813533783,
          0.051123470067977905,
          0.15034818649291992,
          0.12073498964309692,
          0.13308709859848022,
          -0.005412563681602478,
          -0.20688927173614502,
          0.1727708876132965,
          0.04229086637496948,
          0.04763314127922058,
          0.10707679390907288,
          -0.15109461545944214,
          -0.02600046992301941,
          -0.21145792305469513,
          -0.04416827857494354,
          0.19323426485061646,
          0.09190055727958679,
          0.005446791648864746,
          -0.14585459232330322,
          -0.1209181472659111,
          0.06275829672813416,
          0.08099320530891418,
          -0.1841687262058258,
          0.008851692080497742,
          -0.13808494806289673,
          0.056665271520614624,
          0.15998080372810364,
          -0.05529814958572388,
          0.014767661690711975,
          -0.15228767693042755,
          0.041019558906555176,
          0.14441025257110596,
          0.14217641949653625,
          -0.10875153541564941,
          -0.10916769504547119
        ],
        [
          0.14291104674339294,
          0.037316739559173584,
          -0.12684571743011475,
          0.08736655116081238,
          0.1109732985496521,
          0.1081295907497406,
          -0.16701078414916992,
          -0.1627720445394516,
          0.18180608749389648,
          -0.1295051872730255,
          0.21140307188034058,
          -0.0228261798620224,
          0.134477436542511,
          0.19698777794837952,
          -0.005239173769950867,
          0.14508789777755737,
          0.19777345657348633,
          0.024773940443992615,
          0.06528928875923157,
          -0.18528801202774048,
          0.0785876214504242,
          -0.007098093628883362,
          0.13596448302268982,
          -0.10686050355434418,
          -0.036080434918403625,
          -0.1970563381910324,
          -0.2043927013874054,
          -0.1194634735584259,
          -0.11479617655277252,
          0.0165490061044693,
          0.11942979693412781,
          -0.06805546581745148,
          0.21106764674186707,
          -0.030717700719833374,
          0.1125684380531311,
          -0.025682806968688965,
          0.07257428765296936,
          -0.11908929795026779,
          -0.1022813692688942,
          -0.07870951294898987,
          0.12384495139122009,
          -0.05469386279582977,
          0.12175992131233215,
          -0.07138161361217499,
          -0.08603422343730927,
          0.20758414268493652,
          -0.12168148905038834,
          -0.19192807376384735,
          0.09679549932479858,
          0.12740835547447205,
          -0.12617745995521545,
          -0.10765711218118668,
          0.06866860389709473,
          -0.07478323578834534,
          0.11753511428833008,
          0.1534503698348999,
          -0.03487794101238251,
          -0.10126559436321259,
          0.08683210611343384,
          -0.002758339047431946,
          0.014132291078567505,
          0.05057626962661743,
          -0.06889425218105316,
          0.13913771510124207,
          0.007149845361709595,
          -0.11084280163049698,
          0.11447405815124512,
          0.13911744952201843,
          -0.17045918107032776,
          -0.07264932990074158,
          -0.1364404857158661,
          0.08479532599449158
        ],
        [
          -0.2118220180273056,
          0.060516029596328735,
          0.056630104780197144,
          -0.11111534386873245,
          0.1868092119693756,
          0.16255050897598267,
          -0.15938861668109894,
          0.143358051776886,
          -0.12015855312347412,
          -0.11692860722541809,
          0.0706733763217926,
          -0.19390670955181122,
          0.1458446979522705,
          0.11262238025665283,
          0.028360888361930847,
          0.07608786225318909,
          -0.17618174850940704,
          0.18944090604782104,
          0.03324061632156372,
          0.011632204055786133,
          -0.14035654067993164,
          -0.09315267950296402,
          0.08931005001068115,
          0.07665729522705078,
          0.04157477617263794,
          -0.09822017699480057,
          -0.10040269792079926,
          0.015317246317863464,
          0.10865551233291626,
          0.03957197070121765,
          0.16191673278808594,
          0.1354157030582428,
          0.041016608476638794,
          0.07355844974517822,
          0.059552520513534546,
          0.12293946743011475,
          -0.16094188392162323,
          -0.18236956000328064,
          0.0872170627117157,
          -0.02103470265865326,
          -0.08579277992248535,
          0.02145487070083618,
          -0.14657866954803467,
          0.1223013699054718,
          0.005669757723808289,
          -0.07232710719108582,
          0.030795589089393616,
          -0.1244325339794159,
          0.014395400881767273,
          0.13245439529418945,
          0.18330025672912598,
          0.16315239667892456,
